## Requirements

In [29]:
import pandas as pd
from sqlalchemy import create_engine, text
# pip install psycopg2

---
---
---

## Connecting

In [42]:
# 'postgresql://{user}:{password}@{host}:{port}/{db}'
engine = create_engine('postgresql://root:root@localhost:5432/My_Database')
connection = engine.connect()

---
---
---

## Database tables

In [43]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,madrid_houses,root,None,False,False,False,False
1,public,body_fat,root,None,False,False,False,False
2,public,Jena_climate,root,None,False,False,False,False
3,public,customer_data,root,None,False,False,False,False
4,public,alumnos,root,None,True,False,True,False
5,public,examenes,root,None,True,False,True,False
6,public,profesores,root,None,True,False,True,False

In [60]:
query = """
SELECT table_schema, table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_schema, table_name;
"""

pd.read_sql(query, con=engine)

  table_schema     table_name
0       public   Jena_climate
1       public       body_fat
2       public  customer_data
3       public  madrid_houses

---
---
---

## SQL Operations

### Create new tables

#### Using SQL

In [55]:
# Sentencias SQL para crear las tablas usando text()

create_alumnos_table = text("""
CREATE TABLE IF NOT EXISTS alumnos (
    alumno_id VARCHAR(50) PRIMARY KEY,
    nombre TEXT,
    apellido TEXT,
    edad INTEGER,
    grado INTEGER
);
""")

create_profesores_table = text("""
CREATE TABLE IF NOT EXISTS profesores (
    profesor_id VARCHAR(50) PRIMARY KEY,
    nombre VARCHAR(50),
    apellido VARCHAR(50),
    materia VARCHAR(50)
);
""")

create_examenes_table = text("""
CREATE TABLE IF NOT EXISTS examenes (
    examen_id VARCHAR(50) PRIMARY KEY,
    alumno_id VARCHAR(50),
    profesor_id VARCHAR(50),
    nota DECIMAL(5,2),
    fecha DATE,
    FOREIGN KEY(alumno_id) REFERENCES alumnos(alumno_id),
    FOREIGN KEY(profesor_id) REFERENCES profesores(profesor_id)
);
""")

# Ejecutar las sentencias SQL para crear las tablas
connection.execute(create_alumnos_table)
connection.execute(create_profesores_table)
connection.execute(create_examenes_table)

print("Tablas creadas exitosamente.")

Tablas creadas exitosamente.

In [56]:
# Sentencias SQL para insertar registros en las tablas usando text()
insert_alumnos = text("""
INSERT INTO alumnos (alumno_id, nombre, apellido, edad, grado) VALUES
('a1', 'Juan', 'Pérez', 15, 10),
('a2', 'María', 'Gómez', 14, 9),
('a3', 'Carlos', 'Sánchez', 16, 11),
('a4', 'Lucía', 'Fernández', 17, 12),
('a5', 'Andrés', 'Martínez', 15, 10);
""")

insert_profesores = text("""
INSERT INTO profesores (profesor_id, nombre, apellido, materia) VALUES
('p1', 'Ana', 'López', 'Matemáticas'),
('p2', 'Luis', 'Rodríguez', 'Historia'),
('p3', 'Elena', 'Martínez', 'Ciencias'),
('p4', 'Manuel', 'González', 'Inglés'),
('p5', 'Rosa', 'Torres', 'Educación Física');
""")

insert_examenes = text("""
INSERT INTO examenes (examen_id, alumno_id, profesor_id, nota, fecha) VALUES
('e1', 'a1', 'p1', 8.5, '2024-05-10'),
('e2', 'a3', 'p3', 9.0, '2024-05-11'),
('e3', 'a1', 'p1', 7.8, '2024-05-12'),
('e4', 'a2', 'p4', 8.8, '2024-05-13'),
('e5', 'a2', 'p3', 9.2, '2024-05-14'),
('e6', 'a1', 'p3', 8.1, '2024-06-10'),
('e7', 'a5', 'p2', 8.9, '2024-06-11');
""")

# Ejecutar las sentencias SQL para insertar los registros
connection.execute(insert_alumnos)
connection.execute(insert_profesores)
connection.execute(insert_examenes)
 
print("Registros insertados exitosamente.")

Registros insertados exitosamente.

In [57]:
connection.commit()

print("Cambios comprometidos (commited)")

Cambios comprometidos (commited)

#### Using data ingestion script

Explained directly in the course in a visual and practical way.

---
---
---

### Delete tables

- If the tables proposed to be deleted have non dependency --> No problem
- Otherwise --> Problem

In [ ]:
tables_to_drop = ['alumnos', 'profesores', 'examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Assuming that the tables that we want to delete have a dependency among them. 

Alternatives to delete all of them:

- Dropping the dependent table

In [45]:
tables_to_drop = ['examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla examenes eliminada exitosamente.
Cambios comprometidos (commited)

In [46]:
tables_to_drop = ['alumnos', 'profesores']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla alumnos eliminada exitosamente.
Tabla profesores eliminada exitosamente.
Cambios comprometidos (commited)

- Dropping in cascade

In [59]:
tables_to_drop = ['alumnos', 'profesores', 'examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name} CASCADE;")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla alumnos eliminada exitosamente.
Tabla profesores eliminada exitosamente.
Tabla examenes eliminada exitosamente.
Cambios comprometidos (commited)

---
---
---